#+TITLE: Contributing to Kubernetes Conformance Coverage
#+AUTHOR: ii.coop
#+PROPERTY: header-args:tmate+ :session kubekohn :socket /tmp/kubecon

*** Sonobuoy Results
    #+begin_src tmate :window results :var RUN="RESULTS"
      find v1.*/plugins/e2e/results/global
    #+end_src

    #+RESULTS:
    #+begin_example
    v1.18.0_2020-10-20_14:34.00/plugins/e2e/results/global
    v1.18.0_2020-10-20_14:34.00/plugins/e2e/results/global/junit_01.xml
    v1.18.0_2020-10-20_14:34.00/plugins/e2e/results/global/e2e.log
    #+end_example
** PSQL Example Query

Newly Stable Endpoints

   #+begin_src bash :eval never
      export PGUSER=apisnoop PGHOST=localhost
   #+end_src

   #+begin_src bash :var PGHOST="localhost" :var PGUSER="apisnoop" :prologue "export PGHOST PGUSER" :wrap example
     psql -c "with endpoint_and_first_release as (
      select endpoint, level,
      (array_agg(release order by release::semver))[1]
         as first_release
       from open_api group by level, endpoint)
     select level, endpoint, first_release
       from endpoint_and_first_release
      where first_release = '1.20.0' and level='stable';"
   #+end_src

   #+RESULTS:
   #+begin_example
    level  |           endpoint           | first_release
   --------+------------------------------+---------------
    stable | getInternalApiserverAPIGroup | 1.20.0
   (1 row)

   #+end_example

** STOW In Cluster Interfacing

   #+begin_src bash :eval never
      export PGUSER=apisnoop PGHOST=localhost
   #+end_src

   #+begin_src bash :var PGHOST="localhost" :var PGUSER="apisnoop" :prologue "export PGHOST PGUSER" :wrap example
      psql -c "select distinct useragent \
                 from testing.audit_event \
                 where useragent not ilike 'kube-%';"
   #+end_src

   #+RESULTS:
   #+begin_example
                              useragent
   ----------------------------------------------------------------
    kubelet/v1.18.0 (linux/amd64) kubernetes/9e99141
    kindnetd/v0.0.0 (linux/amd64) kubernetes/$Format
    sonobuoy/v0.0.0 (darwin/amd64) kubernetes/$Format
    kubectl/v1.19.2 (darwin/amd64) kubernetes/f574309
    coredns/v0.0.0 (linux/amd64) kubernetes/$Format
    local-path-provisioner/v0.0.0 (linux/amd64) kubernetes/$Format
   (6 rows)

   #+end_example

